                        Aula 1: Análise de Dados com Pandas

Pandas: Biblioteca do python que possibilita acessar e manipular dados
de um dataset

In [1]:
import pandas as pd

Read_csv: Função do pandas que lê e carrega o dataset na memória ram. A função
recebe como argumento o caminho do arquivo que será utilizado na análise(pode ser tanto um caminho local quanto uma URL)

In [2]:
base_de_dados = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

A função head tem como objetivo mostrar as 5 primeiras linhas (por padrão).
A função pode receber como argumento um valor inteiro que irá definir a 
quantidade de linhas que a função irá mostrar

In [3]:
base_de_dados.head(10)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M
5,2025.0,EN,FT,Data Engineer,80000,USD,80000,US,0,US,M
6,2025.0,SE,FT,Data Scientist,185000,USD,185000,US,0,US,M
7,2025.0,SE,FT,Data Scientist,148000,USD,148000,US,0,US,M
8,2025.0,MI,FT,Data Scientist,135000,USD,135000,CA,0,CA,M
9,2025.0,MI,FT,Data Scientist,108000,USD,108000,CA,0,CA,M

A função info tem como objetivo mostrar informações gerais do dataset, como por
exemplo:

-> A quantidade de linhas do dataset

-> A quantidade de colunas do dataset

-> O tipo de cada dado do dataset

-> A quantidade de valores não nulos de cada coluna

-> A quantidade de memória ram utilizada

In [4]:
base_de_dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

O describe irá mostrar dados estatisticos das colunas do dataset. Por
padrão o describe análisa apenas os dados numéricos, porém, é possivel
passar o parametro 'include=object' para ele incluir as colunas categóricas
na análise.

-> count: Quantidade de valores não nulos de cada coluna

-> mean: A média dos valores de cada coluna

-> std: Desvio padrão dos dados de cada coluna

-> min: Valores minimos de cada coluna

-> 25%: Valor que representa 25% dos dados de cada coluna

-> 50%: Valor que representa 50% dos dados de cada coluna

-> 75%: Valor que representa 75% dos dados de cada coluna

-> max: Valores máximo de cada coluna.

In [5]:
base_de_dados.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

O shape irá mostrar as dimensões de um dataset (quantidade de linhas e colunas). Observação: O shape não é uma função, é um atributo

In [6]:
base_de_dados.shape

(133349, 11)

Outra forma de mostrar as linhas e as colunas

In [ ]:
# Variaveis que irão armazenar os valores do atributo shape.
# linhas: Irá armazenar a quantidade de linhas do dataset
# colunas: Ira armazenar a quantidade de colunas do dataset
linhas, colunas = base_de_dados.shape

# Impressão dos resultados
print("Quantidade de linhas da tabela: ", linhas)

print("Quantidade de colunas da tabela: ", colunas)

Quantidade de linhas da tabela:  133349
Quantidade de colunas da tabela:  11

O atributo columns mostra os nomes das colunas do dataset

In [8]:
base_de_dados.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

Função do pandas que tem como objetivo renomear as colunas. A função deve
receber como argumento um dicionário contendo o nome original da coluna
e o nome que queremos definir. Observação: O inplace = True aplica as 
alterações no dataset carregado na memória.

In [9]:
base_de_dados.rename(columns={
    
    'work_year': 'ano',
    'experience_level': 'senioridade',
    'employment_type': 'Contrato',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda',
    'salary_in_usd': 'usd',
    'employee_residence': 'residencia',
    'remote_ratio': 'remoto',
    'company_location': 'empresa',
    'company_size': 'tamanho_empresa'
}, inplace=True)

Verificando se a renomeação funcionou

In [10]:
base_de_dados.columns

Index(['ano', 'senioridade', 'Contrato', 'cargo', 'salario', 'moeda', 'usd',
       'residencia', 'remoto', 'empresa', 'tamanho_empresa'],
      dtype='object')

O value_counts tem como objetivo mostrar a frequência dos valores de cada coluna, ou seja, a quantidade de vezes que um valor unico aparece na coluna

In [11]:
base_de_dados['senioridade'].value_counts()

senioridade
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

In [12]:
base_de_dados['Contrato'].value_counts()

Contrato
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [13]:
base_de_dados['remoto'].value_counts()

remoto
0      105312
100     27718
50        319
Name: count, dtype: int64

In [14]:
base_de_dados['tamanho_empresa'].value_counts()

tamanho_empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

Renomeando as categorias de variáveis categóricas: Basicamente vamos renomear os valores categóricos das colunas, para isso:

-> Vamos criar um dicionário contendo o nome original e o nome
que queremos colocar na categoria

-> Utilizar a função replace para renomear os nomes das categorias
usando como argumento o dicionário de renomeação de categorias de cada coluna

In [15]:
renomear_senioridade = {
    
    'SE': 'Sênior',
    'MI': 'Pleno',
    'EN': 'Junior',
    'EX': 'Executivo'
}

In [ ]:
base_de_dados['senioridade'] = base_de_dados['senioridade'].replace(renomear_senioridade)

In [17]:
base_de_dados['senioridade'].value_counts()

senioridade
Sênior       77241
Pleno        40465
Junior       12443
Executivo     3200
Name: count, dtype: int64

In [18]:
renomear_contrato = {
    
    'FT': 'Tempo Integral',
    'PT': 'Tempo Parcial',
    'FL': 'Freela',
    'CT': 'Contrato'
}

In [19]:
base_de_dados['Contrato'] = base_de_dados['Contrato'].replace(renomear_contrato)

In [20]:
base_de_dados['Contrato'].value_counts()

Contrato
Tempo Integral    132563
Contrato             394
Tempo Parcial        376
Freela                16
Name: count, dtype: int64

In [21]:
renomear_tamanho_empresa = {
    
    'M':'Médio Porte',
    'L': 'Grande Porte',
    'S': 'Pequeno Porte'
}

In [22]:
base_de_dados['tamanho_empresa'] = base_de_dados['tamanho_empresa'].replace(renomear_tamanho_empresa)

In [23]:
base_de_dados['tamanho_empresa'].value_counts()

tamanho_empresa
Médio Porte      129561
Grande Porte       3574
Pequeno Porte       214
Name: count, dtype: int64

In [27]:
renomear_remoto = {
    
    0:'Presencial',
    100: 'Remoto',
    50: 'Hibrido'
}

In [28]:
base_de_dados['remoto'] = base_de_dados['remoto'].replace(renomear_remoto)

In [29]:
base_de_dados['remoto'].value_counts()

remoto
Presencial    105312
Remoto         27718
Hibrido          319
Name: count, dtype: int64

Verificando a tabela após as modificações

In [30]:
base_de_dados.head(10)

,ano,senioridade,Contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Sênior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio Porte
1,2025.0,Sênior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio Porte
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio Porte
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio Porte
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Médio Porte
5,2025.0,Junior,Tempo Integral,Data Engineer,80000,USD,80000,US,Presencial,US,Médio Porte
6,2025.0,Sênior,Tempo Integral,Data Scientist,185000,USD,185000,US,Presencial,US,Médio Porte
7,2025.0,Sênior,Tempo Integral,Data Scientist,148000,USD,148000,US,Presencial,US,Médio Porte
8,2025.0,Pleno,Tempo Integral,Data Scientist,135000,USD,135000,CA,Presencial,CA,Médio Porte
9,2025.0,Pleno,Tempo Integral,Data Scientist,108000,USD,108000,CA,Presencial,CA,Médio Porte

Utilizando a função describe com o argumento include = object:

-> count: Quantidade de valores não nulos da coluna

-> unique: Quantidade de valores únicos das colunas

-> top: Valores mais frequentes de cada coluna

-> freq: quantidade de vezes que os valores mais frequentes
aparecem

In [32]:
base_de_dados.describe(include=object)

,senioridade,Contrato,cargo,moeda,residencia,remoto,empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,Sênior,Tempo Integral,Data Scientist,USD,US,Presencial,US,Médio Porte
freq,77241,132563,17314,126140,119579,105312,119641,129561